many_connections/many_conn_test16.txt
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 2
number of threads: 1
maximum number of tries: 1
number of transactions per client: 50
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 11.656 ms
initial connection time = 4.159 ms
tps = 171.588983 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 4
number of threads: 1
maximum number of tries: 1
number of transactions per client: 25
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 18.822 ms
initial connection time = 35.727 ms
tps = 212.514106 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 8
number of threads: 1
maximum number of tries: 1
number of transactions per client: 12
number of transactions actually processed: 96/96
number of failed transactions: 0 (0.000%)
latency average = 111.349 ms
initial connection time = 74.526 ms
tps = 71.845962 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 16
number of threads: 1
maximum number of tries: 1
number of transactions per client: 6
number of transactions actually processed: 96/96
number of failed transactions: 0 (0.000%)
latency average = 55.831 ms
initial connection time = 186.724 ms
tps = 286.581707 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 32
number of threads: 1
maximum number of tries: 1
number of transactions per client: 3
number of transactions actually processed: 96/96
number of failed transactions: 0 (0.000%)
latency average = 59.682 ms
initial connection time = 285.524 ms
tps = 536.178056 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 64
number of threads: 1
maximum number of tries: 1
number of transactions per client: 2
number of transactions actually processed: 128/128
number of failed transactions: 0 (0.000%)
latency average = 165.570 ms
initial connection time = 360.657 ms
tps = 386.544623 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 128
number of threads: 1
maximum number of tries: 1
number of transactions per client: 1
number of transactions actually processed: 128/128
number of failed transactions: 0 (0.000%)
latency average = 371.387 ms
initial connection time = 770.250 ms
tps = 344.653959 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 2
number of threads: 1
maximum number of tries: 1
number of transactions per client: 50
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 5.783 ms
initial connection time = 3.679 ms
tps = 345.835279 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 4
number of threads: 1
maximum number of tries: 1
number of transactions per client: 25
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 9.630 ms
initial connection time = 45.728 ms
tps = 415.354838 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 8
number of threads: 1
maximum number of tries: 1
number of transactions per client: 12
number of transactions actually processed: 96/96
number of failed transactions: 0 (0.000%)
latency average = 19.341 ms
initial connection time = 18.899 ms
tps = 413.639771 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 16
number of threads: 1
maximum number of tries: 1
number of transactions per client: 6
number of transactions actually processed: 96/96
number of failed transactions: 0 (0.000%)
latency average = 34.204 ms
initial connection time = 46.032 ms
tps = 467.781546 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 32
number of threads: 1
maximum number of tries: 1
number of transactions per client: 3
number of transactions actually processed: 96/96
number of failed transactions: 0 (0.000%)
latency average = 45.042 ms
initial connection time = 106.303 ms
tps = 710.448026 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 64
number of threads: 1
maximum number of tries: 1
number of transactions per client: 2
number of transactions actually processed: 128/128
number of failed transactions: 0 (0.000%)
latency average = 144.681 ms
initial connection time = 193.197 ms
tps = 442.352486 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 128
number of threads: 1
maximum number of tries: 1
number of transactions per client: 1
number of transactions actually processed: 128/128
number of failed transactions: 0 (0.000%)
latency average = 390.909 ms
initial connection time = 489.941 ms
tps = 327.441937 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 2
number of threads: 1
maximum number of tries: 1
number of transactions per client: 500
number of transactions actually processed: 1000/1000
number of failed transactions: 0 (0.000%)
latency average = 3.296 ms
initial connection time = 28.265 ms
tps = 606.725798 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 4
number of threads: 1
maximum number of tries: 1
number of transactions per client: 250
number of transactions actually processed: 1000/1000
number of failed transactions: 0 (0.000%)
latency average = 5.822 ms
initial connection time = 36.565 ms
tps = 687.108134 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 8
number of threads: 1
maximum number of tries: 1
number of transactions per client: 125
number of transactions actually processed: 1000/1000
number of failed transactions: 0 (0.000%)
latency average = 11.943 ms
initial connection time = 39.353 ms
tps = 669.861011 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 16
number of threads: 1
maximum number of tries: 1
number of transactions per client: 62
number of transactions actually processed: 992/992
number of failed transactions: 0 (0.000%)
latency average = 24.855 ms
initial connection time = 102.390 ms
tps = 643.724883 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 32
number of threads: 1
maximum number of tries: 1
number of transactions per client: 31
number of transactions actually processed: 992/992
number of failed transactions: 0 (0.000%)
latency average = 54.141 ms
initial connection time = 155.674 ms
tps = 591.049649 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 64
number of threads: 1
maximum number of tries: 1
number of transactions per client: 16
number of transactions actually processed: 1024/1024
number of failed transactions: 0 (0.000%)
latency average = 119.946 ms
initial connection time = 180.180 ms
tps = 533.575388 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 128
number of threads: 1
maximum number of tries: 1
number of transactions per client: 8
number of transactions actually processed: 1024/1024
number of failed transactions: 0 (0.000%)
latency average = 258.692 ms
initial connection time = 508.628 ms
tps = 494.797140 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 256
number of threads: 1
maximum number of tries: 1
number of transactions per client: 4
number of transactions actually processed: 1024/1024
number of failed transactions: 0 (0.000%)
latency average = 767.609 ms
initial connection time = 787.235 ms
tps = 333.503233 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 512
number of threads: 1
maximum number of tries: 1
number of transactions per client: 2
number of transactions actually processed: 1024/1024
number of failed transactions: 0 (0.000%)
latency average = 2705.287 ms
initial connection time = 1386.644 ms
tps = 189.259067 (without initial connection time)