many_connections/many_conn_test256.txt
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 2
number of threads: 1
maximum number of tries: 1
number of transactions per client: 50
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 5.058 ms
initial connection time = 26.428 ms
tps = 395.427279 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 4
number of threads: 1
maximum number of tries: 1
number of transactions per client: 25
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 14.247 ms
initial connection time = 15.197 ms
tps = 280.762438 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 8
number of threads: 1
maximum number of tries: 1
number of transactions per client: 12
number of transactions actually processed: 96/96
number of failed transactions: 0 (0.000%)
latency average = 20.815 ms
initial connection time = 75.233 ms
tps = 384.344373 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 16
number of threads: 1
maximum number of tries: 1
number of transactions per client: 6
number of transactions actually processed: 96/96
number of failed transactions: 0 (0.000%)
latency average = 28.980 ms
initial connection time = 156.244 ms
tps = 552.098550 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 32
number of threads: 1
maximum number of tries: 1
number of transactions per client: 3
number of transactions actually processed: 96/96
number of failed transactions: 0 (0.000%)
latency average = 59.819 ms
initial connection time = 106.188 ms
tps = 534.950071 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 64
number of threads: 1
maximum number of tries: 1
number of transactions per client: 2
number of transactions actually processed: 128/128
number of failed transactions: 0 (0.000%)
latency average = 175.860 ms
initial connection time = 194.186 ms
tps = 363.925850 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 128
number of threads: 1
maximum number of tries: 1
number of transactions per client: 1
number of transactions actually processed: 128/128
number of failed transactions: 0 (0.000%)
latency average = 533.921 ms
initial connection time = 269.761 ms
tps = 239.735841 (without initial connection time)